[
    {
        "id": 1,
        "project_name": "Yoda Me Astrology",
        "image": "/photos/yodame.png",
        "description": "One of my first projects working with a group. We were tasked with creating a responsive app using a new css library, and new API's. We created a horoscope of the day app that translated your daily horoscope into how yoda will speak. It all worked together except for the yoda translater not being able to perfectly translate complex sentences.",
        "location": "https://stephimarie.github.io/Yoda_me_astrology/",
        "repo": "https://github.com/maxx-808/Yoda_me_astrology.git",
        "skills": "Javascript, Third Party Apis like horocsope-api and yoda-speak, Axios, Bulma.css, and jQuery."
    },    {
        "id": 2,
        "project_name": "Busy Hour Scheduler",
        "image": "/photos/hourscheduler.jpg",
        "description": "I needed to create our own app to save things to do throughout the day in local storage. it also shows, using color, what time block you are currently in and what was past and is in the future.",
        "location": "https://maxx-808.github.io/Busy-Hour-Scheduler/",
        "repo": "https://github.com/maxx-808/Busy-Hour-Scheduler.git",
        "skills": "Javascript, jQuery, Bootstrap, Moment.js, and localStorage."
    },    {
        "id": 3,
        "project_name": "Employee Directory",
        "image": "/photos/directory.jpg",
        "description": "I was tasked with creating a react app that takes an array of objects from a random user generator and create a table that can be sorted and filtered. Works like a directory for your employees. My app can sort the employees by gender, last name, and can filter out anyone under 10 years of experience.",
        "location": "https://maxx-808.github.io/employee-directory/",
        "repo": "https://github.com/maxx-808/employee-directory.git",
        "skills": "JavaScript, Axios, Reactjs, React router dom, and gh-pages"
    },    {
      
        "id": 4,
        "project_name": "GreenHaus",
        "image": "/photos/greenhaus.png",
        "description": "For this project, I worked with a group. we were tasked with creating a full stack application using npm packages as well as CRUD functionality and database usage. We created an app for consumers that want to keep track and log down there plants and the growth of them. Although there are some stuff added in that is not fully usable, we added a way to upload photos of your plants as well to be saved and brought up again.",
        "location": "https://vast-escarpment-39602.herokuapp.com/plants",
        "repo": "https://github.com/maxx-808/Greenhaus.git",
        "skills": "JavaScript, Express, Axios, gifencoder npm, multer, mysql2, and sequelize."
    },    {
        "id": 5,
        "project_name": "Budget Tracker",
        "image": "/photos/budgettracker.jpg",
        "description": "Currently the base of the application is deployed. This will continue to be updated with working code. Thinking of a way to showcase all I learned so far, I decided to create an application that I could use for day to day life. I thought of an app that tracks your income and expenses and gives back data in tables and graphs logging down all you spend and your income to show how well one can use money throughout their life. Using new techniques to create this app as well as refining my current knowledge to Bring this up",
        "location": "https://budget-tracker727.herokuapp.com/",
        "repo": "https://github.com/maxx-808/budget-tracking",
        "skills": "JavaScript, Express, React, Mongoose, Nodejs, googleapis, oAuth2, nodemailer, bcryptjs, jsonwebtoken, cors, concurrently, Axios, bootstrap, and react router dom."
    }
]